<template>

    <div id="profile" class="absolute z-50 w-full items-center h-14 flex-row-reverse justify-between pl-4 mt-2 hidden">
        <div class="w-full h-full flex items-center flex-row-reverse space-x-2 space-x-reverse pr-4">
            <button id="profile-button">
                <svg class="w-14 h-14" version="1.2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1024 1024" >
                    <title>DALL·E 2024-09-30 23 </title>

                    <g id="Layer 1">
                        <path id="форма 5" fill-rule="evenodd" class="s0" d="m225.8 483.8l36.6 32.8-32.7 36.7-36.7-32.8z"/>
                        <path id="форма 2" fill-rule="evenodd" class="s1" d="m249.8 737.2c0 0 45.1-61.3 176.5-99.7 0 0 61.6 57.1 151.6 4.1 0 0 137.6 32.1 184.4 102.4 0 0-268 252.1-512.5-6.8z"/>
                        <path id="форма 1" fill-rule="evenodd" class="s2" d="m511.9 920c-233.1 0-421.5-182.1-421.5-407.5 0-225.4 188.4-407.6 421.5-407.6 233.1 0 421.5 182.2 421.5 407.6 0 225.4-188.4 407.5-421.5 407.5z"/>
                        <path id="форма 5 copy" fill-rule="evenodd" class="s0" d="m778.8 479.7l36.7 32.8-32.8 36.7-36.6-32.8z"/>
                        <path id="форма 3" fill-rule="evenodd" class="s1" d="m512.4 612.9c0 0 77.9 0.3 120.3-95.3 0 0 24.8-10.6 34.2-46.1l-3-88c0 0-18.7-70.6-73.7-94.2 0 0 8-39.6-4.1-61.5 0 0-50.8 22.8-118.8-16.3 0 0-32.8 11.7 24.6 53.2 0 0-103.7 18.7-135.2 16.4 0 0-44.2 3.8 0 41l28.7 4.1c0 0-54.8 46.9-41 159.7 0 0 22.7 17.1 32.8 28.7 0 0 1.1 65.7 135.2 98.3z"/>
                        <path id="форма 4" fill-rule="evenodd" class="s3" d="m745.9 522.8"/>
                    </g>
                </svg>
            </button>
            
            <button id="inventory-button">
                <svg class="w-14 h-12" version="1.2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1024 1024" >
                    <title>DALL·E 2024-09-30 23 </title>

                    <g id="Layer 1">
                        <path id="форма 3" fill-rule="evenodd" class="s0" d="m378.3 635.9h270.8c0 0-21.9-35.7-38-101.8 0 0-10.2-55-11.5-93.4h-174.6c0 0-10.1 143.4-46.7 195.2z"/>
                        <path id="форма 1" fill-rule="evenodd" class="s0" d="m422.3 300.5h181.4c0 0 55-42.8 54.4-109.4 0 0 4.6-138.8-144-145.7 0 0-99.2-0.1-134.6 83.6 0 0-49.3 105.3 42.8 171.5z"/>
                        <path id="форма 2" fill-rule="evenodd" class="s0" d="m342.6 369c0 0-2.1-30.3 35.3-28.7 6.1 0.4 275.3 0 275.3 0 0 0 26.1-1.3 30.2 30.3 0 0-0.5 21.1-24.7 27.5h-292.8c0 0-23.4-3.4-23.3-29.1z"/>
                        <path id="форма 2 copy" fill-rule="evenodd" class="s0" d="m312.4 701.6c0 0-2.5-27.4 41.6-25.9 7.1 0.3 324 0 324 0 0 0 30.8-1.2 35.7 27.3 0 0-0.7 19.2-29.2 25h-344.6c0 0-27.7-3.1-27.5-26.4z"/>
                        <path id="форма 2 copy 2" fill-rule="evenodd" class="s0" d="m242.3 936.7c0 0-3.3-27.5 56.1-26 9.7 0.3 437.3 0 437.3 0 0 0 41.5-1.2 48.1 27.4 0 0-0.9 19.1-39.4 24.9h-465c0 0-37.3-3.1-37.1-26.3z"/>
                        <path id="форма 4" fill-rule="evenodd" class="s0" d="m276.6 869.5h474.2c0 0 38-20.2 11-74.2 0 0-7.7-24.7-35.8-31.6h-427.4c0 0-45 7.5-45.4 67.4 0 0-0.2 30.4 23.4 38.4z"/>
                    </g>
                </svg>
            </button>
            <button> 
                <svg class="w-14 h-14" version="1.2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1024 1024" >
                    <title>DALL·E 2024-09-30 23 </title>

                    <g id="Layer 1">
                        <path id="форма 4" fill-rule="evenodd" class="s0" d="m512.5 826.9v-35.5c0 0-43.5-0.2-70.8-51.5-32-60-239.1-107.1-322.9-80.6l28-361.9c0 0-19.4-3.9-33.1 15.3l-31.7 379.6c0 0 2 13.3 35.6 0 0 0 144.7-35.7 294.5 57.2 0 0 26.7 74.5 100.4 77.4z"/>
                        <path id="форма 4 copy" fill-rule="evenodd" class="s0" d="m511.2 826.9v-35.5c0 0 43.4-0.2 70.8-51.5 31.9-60 239.1-107.1 322.8-80.6l-27.9-361.9c0 0 19.4-3.9 33 15.3l31.8 379.6c0 0-2 13.3-35.6 0 0 0-144.8-35.7-294.6 57.2 0 0-26.6 74.5-100.3 77.4z"/>
                        <path id="форма 3" fill-rule="evenodd" class="s0" d="m165.6 624.2l1.2-17.9c0 0 75-39.5 202.9 23.9 0 0 56.6 23.3 99.2 65.5 16.3 16.2 30 31.9 42.9 36v22.8c0 0-14.2 3.3-35.8-26.4 0 0-113.4-122.2-310.4-103.9z"/>
                        <path id="форма 3 copy" fill-rule="evenodd" class="s0" d="m856.8 624.2l-1.2-17.9c0 0-75-39.5-202.9 23.9 0 0-56.6 23.3-99.2 65.5-16.4 16.2-30.1 31.9-42.9 36v22.8c0 0 14.1 3.3 35.8-26.4 0 0 113.4-122.2 310.4-103.9z"/>
                        <path id="форма 2" fill-rule="evenodd" class="s0" d="m193 244.6l-18.9 309.2c0 0 199.4-37.3 325.7 142 0 0 13.1-16.8-54.9-89.5 0 0-103-89.7-244.7-81.2l14.5-274.1c0 0-14.8 0.1-21.7-6.4z"/>
                        <path id="форма 2 copy" fill-rule="evenodd" class="s0" d="m829.3 244.6l19 309.2c0 0-199.4-37.3-325.8 142 0 0-13-16.8 54.9-89.5 0 0 103.1-89.7 244.8-81.2l-14.5-274.1c0 0 14.8 0.1 21.6-6.4z"/>
                        <path id="форма 1" fill-rule="evenodd" class="s0" d="m243.2 198c0 0 210.3 27.2 259.4 120.5v322.4c0 0-47.4-119.9-275-148z"/>
                        <path id="форма 1 copy" fill-rule="evenodd" class="s0" d="m779.5 198c0 0-210.3 27.2-259.4 120.5v322.4c0 0 47.5-119.9 275-148z"/>
                    </g>
                </svg>
            </button>

           
        </div>

        <button id="menu-icon" >
            <svg class="w-14 h-14" version="1.2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1024 1024">
                <title>DALL·E 2024-10-01 00</title>

                <g id="Layer 1">
                    <path id="форма 1" fill-rule="evenodd" class="s0" d="m202.9 503.7c0 0 37.1-22.7 53.6-44.7l45.1-61.9c0 0 31.5-50.8 39.8-54.3 0 0 49.2-59.4 155.7-69.3 0 0 171.8-32 201.4-40.4 0 0 61 0.1 76.3-6.5 0 0 47.3-18.7 58.1-40.2 0 0-47.2 97.5-125.1 129.6 0 0-48.8 27.2-89.4 26.8h-138.5c0 0-18.3 3.9-22.3 13.8 0 0 223.2 13.6 280.5 51.1 0 0-79.7 25.3-126.4 18.5 0 0 6 6.1 19 12 0 0 116.4 48.6 139.6 262.1 0 0-3.8 96.8-26.8 138.5 0 0 8.1-122.7-53.6-232.4 0 0-42.1-89.1-121.8-115.6 0 0 73.9 20.1 120.4 158.2 0 0 19.4 100-70.1 212.1 0 0 39.5-100 1.9-200 0 0-21.5-59.7-64.4-103.8 0 0 81.2 114.9 58.1 214.5 0 0-49.8 120.2-116.2 169.8l-62.6-53.6c0 0 58.8-67.7 81.4-116.4 0 0 29.1-101.1 16.9-151.7 0 0-34.7-82.2-71.5-107.3 0 0 85.6 90.4 53.7 205.6 0 0-61.3 117.9-107.3 138.5 0 0-4.4-31.1-58.1-26.8l-98.3 53.6c0 0-12.9-29.1 97.9-99.1 0 0 96-114.7 98.7-160.1 0 0 6.7-73.7-62.5-53.6l-98.3 35.7c0 0-20-13.9-18.6-42 0 0-11.5-18.1-30.6-16 0 0-40.7-22.9-35.7-44.7z"/>
                    <path id="форма 3" fill-rule="evenodd" class="s0" d="m42 494.7l464.7-464.7 167.6 167.6-24.6 24.6-145.2-145.3-417.9 417.8 242.1 261z"/>
                    <path id="форма 4" fill-rule="evenodd" class="s0" d="m743.5 324.9l24.7-24.6 185.5 185.5-147.5 147.5v-45l100.4-100.4z"/>
                </g>
            </svg>
        </button>
</div>


</template>

<script>
</script>


<style scoped>
.s0 { fill: #ffffff;stroke: #ffffff;stroke-miterlimit:10 } 
.s1 { fill: #ffffff } 
.s2 { fill: none;stroke: #ffffff;stroke-miterlimit:10;stroke-width: 38 } 
.s3 { fill: none;stroke: #ffffff;stroke-miterlimit:10 } 
.s0 { fill: #ffffff } 
.s0 { fill: #ffffff } 
.s0 { fill: #ffffff } 
</style>